 [
    {"word": "ocean", "hint": "A large body of saltwater that covers most of the Earth's surface."},
    {"word": "python", "hint": "A popular programming language known for its simplicity."},
    {"word": "gravity", "hint": "The force that attracts objects toward each other, especially toward the Earth."},
    {"word": "electricity", "hint": "A form of energy resulting from charged particles."},
    {"word": "jupiter", "hint": "The largest planet in our solar system."},
    {"word": "eclipse", "hint": "An event where one celestial body moves into the shadow of another."},
    {"word": "hurricane", "hint": "A powerful tropical storm with strong winds and rain."},
    {"word": "algorithm", "hint": "A step-by-step procedure for solving a problem."},
    {"word": "bacteria", "hint": "Microscopic organisms that can be found in various environments."},
    {"word": "volcano", "hint": "A mountain that erupts with lava, ash, and gases."},
    {"word": "satellite", "hint": "An object that orbits a planet or star."},
    {"word": "nebula", "hint": "A cloud of gas and dust in space, often forming stars."},
    {"word": "photosynthesis", "hint": "The process by which plants convert sunlight into energy."},
    {"word": "robotics", "hint": "The field of technology dealing with robots."},
    {"word": "tsunami", "hint": "A giant wave caused by an underwater earthquake or volcanic eruption."},
    {"word": "oxygen", "hint": "An essential gas for most living organisms to breathe."},
    {"word": "asteroid", "hint": "A small rocky body orbiting the Sun, mostly found between Mars and Jupiter."},
    {"word": "lightning", "hint": "A sudden electrostatic discharge during a thunderstorm."},
    {"word": "pandemic", "hint": "A disease outbreak that spreads across countries or continents."},
    {"word": "quantum", "hint": "The smallest unit of energy in physics."},
    {"word": "ecosystem", "hint": "A community of living organisms interacting with their environment."},
    {"word": "galaxy", "hint": "A massive system of stars, planets, and other celestial objects."},
    {"word": "virus", "hint": "A microscopic agent that can cause infections."},
    {"word": "fossil", "hint": "The remains or impression of an ancient organism preserved in rock."},
    {"word": "chromosome", "hint": "A structure carrying genetic material in the form of DNA."},
    {"word": "solar", "hint": "Related to the Sun or its energy."},
    {"word": "climate", "hint": "The weather conditions in a region over a long period."},
    {"word": "blackhole", "hint": "A region in space where gravity is so strong that nothing can escape it."},
    {"word": "diamond", "hint": "A precious gemstone formed under high pressure and heat."},
    {"word": "computer", "hint": "A device used for processing and storing data electronically."}
  ]